<template>
  <FullScreenContainer class="page" :bgImg="require('@/assets/img/bg_xieyi_help.png')">
    <Top />
    <div class="container row">
      <div class="w440 container-left" ref="container-left">
        <div class="plr48">使用帮助</div>
        <div 
          class="ellipsis plr48" 
          :class="{active: idx === activeIdx}"
          v-for="(item, idx) in helpList" 
          :key="idx" 
          ref="helpEl"
          v-focusable
          @onFocus="onFocusQuestion(idx)"
          @click="onFocusContent(idx)"
          >
          <span>{{item.title}}</span>
        </div>
      </div>
    </div>
    <div class="content" ref="content">
      <div class="help-title-box">
        如何绑定设备？
      </div>
      <div class="help-content-box" :class="{active: isFocusContent}">
        <pre>
          <span v-focusable @onFocus="onFocusContent">本协议是您与家庭健康应用（简称“本应用”）所有者（中国电信综合平台开发运营中心以下简称为“综合平台”）之间就本应用服务等相关事宜所订立的契约，请您仔细阅读本用户协议，您点击“同意”按钮后即完全同意本协议，本协议即构成对双方有约束力的法律文件。</span>

          第1条 本应用服务条款的确认和接纳

          1.1. 用户点击同意本协议的，即视为用户确认自己具有享受本应用服务（TV端及手机端）、下单购买、报告查看、医生咨询等相应的权利能力和行为能力，能够独立承担法律责任。
          
          1.2. 如果您在18周岁以下，您只能在父母或监护人的监护参与下才能使用本应用
          
          <span v-focusable>1.3. 综合平台保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单的权利。</span>
          
          
          <span v-focusable>第2条 用户信息</span>
          
          <span v-focusable>2.1. 用户应自行诚信向本应用提供注册/绑定资料，用户同意其提供的注册/绑定资料真实、准确、完整、合法有效。如果用户提供的注册/绑定资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且本应用保留终止用户使用各项服务的权利。</span>
          
          <span v-focusable>2.2. 用户在本应用进行购买活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本应用将予以严格保密，除非得到用户的授权或法律另有规定，本应用不会向外界披露用户隐私信息。</span>
          
          <span v-focusable>2.3. 用户同意，本应用拥有通过邮件、短信、电话、微信等形式，向在本应用绑定或自行设置的用户发送服务消息的权利。</span>
          
          <span v-focusable>2.4 用户点击同意本协议，即表示用户同意授权本应用，除法律另有规定之外，将本人提供给本应用的信息、享受本应用服务产生的信息（包括本用户协议签署之前提供和产生的信息）以及应用根据约定查询、收集的信息，用于本应用及其因服务必要委托的合作伙伴为本人提供服务、推荐产品、开展市场调查与信息数据分析；</span>
          
          <span v-focusable>2.5  用户点击同意本协议，即表示用户同意授权家庭健康服务（TV端及手机端）获取其家庭云盘账户里的家庭成员信息。</span>
          
          <span v-focusable>第3条 隐私声明</span>
          
          <span v-focusable>3.1 本应用有权采取措施验证您提供的个人信息的真实性。如果您提供了有关他人的个人信息，则表明您已取得了他人的正式许可。本公司承诺，除非出于您自己的意愿，本公司不会将您的个人信息提供给本公司及其关联企业之外的任何第三方。</span>
          
          <span v-focusable>3.2 综合平台承诺：非经法律程序，不会泄露您的个人信息（包括姓名、身份证号、电话、体检数据等）。</span>
          
          <span v-focusable>第4条 服务内容</span>
          
          <span v-focusable>4.1 用户在家庭健康应用绑定设备即授权家庭健康（TV端及手机端）获取该设备产生的数据并在家庭健康（TV端及手机端）展示，所展示的健康数据均是自行绑定设备产生的数据并由设备厂商提供的标准字段所展示，用户应自行承担数据结果。用户应了解并知悉设备厂商提供的数据可能存在误差，对于因此产生的损失，本应用不承担任何责任。</span>
          
          <span v-focusable>4.2 用户在家庭健康应用使用第三方提供的检测服务应由第三方负责，本应用只负责将调用结果作展示，检测结果仅供参考，不作为医疗临床检测结果。本应用作为医患互通服务的平台，不对第三方发布的信息的来源和正确性负责，不参与检测服务，不对检测的结果承担任何责任。</span>
          
          <span v-focusable>4.3 用户在本应用购买第三方合作的服务表示已充分了解并同意服务的条款。</span>
          
          <span v-focusable>4.4 双方权利和义务</span>
          <span v-focusable>（1）本应用有义务在现有技术上维护平台服务的正常进行，并努力提升技术及改进技术，使服务更好进行。</span>
          <span v-focusable>（2）对于用户在本应用预定服务中的不当行为或其它任何本应用认为应当终止服务的情况，本应用有权随时作出删除相关信息、终止服务提供等处理，而无须征得用户的同意。</span>
          <span v-focusable>（3）本应用有权根据不同情况选择保留或删除相关信息或继续、停止对该用户提供服务，并追究相关法律责任。</span>
          <span v-focusable>（4）本应用中的相关服务如ai-ecg是以收费方式提供的，如您使用收费服务，请遵守相关的协议。本应用有权根据实际需要对收费服务的收费标准、方式进行修改和变更。</span>
          <span v-focusable>（5）系统因下列状况无法正常运作，使用户无法使用提供的服务时，本应用不承担损害赔偿责任，该状况包括但不限于：</span>
          <span v-focusable>在本应用公告之系统停机维护期间；</span>
          <span v-focusable>电信设备出现故障不能进行数据传输的；</span>
          <span v-focusable>因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成系统障碍不能执行业务的；</span>
          <span v-focusable>由于电信部门技术调整或故障、银行方面的问题等原因而造成的服务中断或者延迟。</span>
          <span v-focusable>第三方的合作服务机构瑕疵、政府行为等原因导致的服务中断、数据丢失以及其他损失和风险。</span>
          
          <span v-focusable>第5条 所有权及知识产权条款</span>
          
          <span v-focusable>5.1. 综合平台是本应用的制作者，拥有此应用内容及资源的著作权等合法权利，受国家法律保护，有权不时地对本协议及本应用的内容进行修改，并在本应用张贴，无须另行通知用户。在法律允许的最大限度范围内，综合平台对本协议及本应用内容拥有解释权。</span>
          
          <span v-focusable>5.2. 除法律另有强制性规定外，未经综合平台明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本应用的信息内容，否则，综合平台有权追究其法律责任。</span>
          
          <span v-focusable>第6条 责任限制及不承诺担保</span>
          
          <span v-focusable>6.1 除非另有明确的书面说明，家庭健康应用及其所包含的或以其它方式通过本应用提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在“按现状”和“按现有”的基础上提供的。除非另有明确的书面说明，综合平台不对本应用的运营及其包含在本应用上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</span>
          
          <span v-focusable>6.2 本应用所有信息仅供参考，不做个别医疗诊断、用药和使用的根据。</span>
          
          <span v-focusable>第7条 法律管辖和适用</span>
          
          <span v-focusable>本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向有管辖权的家庭健康经营主体所在地法院提起诉讼。</span>
        </pre>
      </div>
    </div>
    <div class="button-box">>
      <Button class="button-box-btn" :width="360">返  回</Button>
    </div>
  </FullScreenContainer>
</template>

<script>
export default {
  name: 'UserAgreement',
  data() {
    return {
      helpList: [{
        title: '如何绑定设备？',
        content: `    八效型即九音军商华导研最响增。志参主号队它用回工北同什什造质需重总力备求所决究究备光例置设门他动月号较根相单万约照机计我第见严但等件务市红步采当他派国间问亲规的。
        了段命可加新角料东动正头图义展见战带子平高物内火教公还思线改图技不强四专大进越问导高形回步们但治非民龙还何加且道给史离。北位进观日精温见统月质我思飞织习日题行应十劳人交候术至程亲风力次研真时国现决再省又金或以务少列已价。
        红王她往样今反又正支任数物果数料之战为所算同南阶被华重照通门自活影众石王农按住达在放部也维增文科万老北出。
        声为加其立却战半养想根件行转二面确际为济名好采手平民题变大将先被阶斗精国院保手声成程处复。
        完商定主及老计第切老教头油题平约划安共意到基权展而类提气统需备先长养安好五消见文市命还求本新起现声厂理些如业部数决。
        文满先斗为难小马证战名两层展回这局格更型音多第需性况代队维转更转做个选自马与反无造规么农可据用必厂意九车无二原民易区交名确研工没识线么所方约特。况进及看界铁龙期要造认二江飞开响可联九后律习名四拉历一到列路没写局会复算界报料际国后口品次群型记先政务情研直研府料况飞参支文万月圆派专建员书性气。青身与手此些儿规了精样研全过八运向圆办在支头空装就不原此流存候学断有达我无。做制统题市这风更积成义具热命标问己己取片并及周回层亲行料报划具住建比基备速严查问技。研连向小理物动声研京己价省集口斯增由通务斗厂合金却装一由没而为后资体去越及本由民却海府为民却海。如何绑定设备新有活在这价儿约日农温积料分参准己维权值增统例山适证式思号细出次属是现议总海写八效型即九音军商华导研最响增。
        志参主号队它用回工北同什什造质需重总力备求所决究究备光例置设门他动月号较根相单万约照机计我第见严但等件务市红步采当他派国间问亲规的。了段命可加新角料东动正头图义展见战带子平高物内火教公还思线改图技不强四专大进越问导高形回步们但治非民龙还何加且道给史离。北位进观日精温见统月质我思飞织习日题行应十劳人交候术至程亲风力次研真时国现决再省又金或以务少列已价。
        红王她往样今反又正支任数物果数料之战为所算同南阶被华重照通门自活影众石王农按住达在放部也维增文科万老北出。声为加其立却战半养想根件行转二面确际为济名好采手平民题变大将先被阶斗精国院保手声成程处复。完商定主及老计第切老教头油题平约划安共意到基权展而类提气统需备先长养安好五消见文市命还求本新起现声厂理些如业部数决。文满先斗为难小马证战名两层展回这局格更型音多第需性况代队维转更转做个选自马与反无造规么农可据用必厂意九车无二原民易区交名确研工没识线么所方约特。况进及看界铁龙期要造认二江飞开响可联九后律习名四拉历一到列路没写局会复算界报料际国后口品次群型记先政务情研直研府料况飞参支文万月圆派专建员书性气。青身与手此些儿规了精样研全过八运向圆办在支头空装就不原此流存候学断有达我无。做制统题市这风更积成义具热命标问己己取片并及周回层亲行料报划具住建比基备速严查问技。研连向小理物动声研京己价省集口斯增由通务斗厂合金却装一由没而为后资体去越及本由民却海府为民却海。`
      },{
        title: '如何购买设备？',
        content: '    如何购买设备新有活在这价儿约日农温积料分参准己维权值增统例山适证式思号细出次属是现议总海写八效型即九音军商华导研最响增。志参主号队它用回工北同什什造质需重总力备求所决究究备光例置设门他动月号较根相单万约照机计我第见严但等件务市红步采当他派国间问亲规的。了段命可加新角料东动正头图义展见战带子平高物内火教公还思线改图技不强四专大进越问导高形回步们但治非民龙还何加且道给史离。北位进观日精温见统月质我思飞织习日题行应十劳人交候术至程亲风力次研真时国现决再省又金或以务少列已价。红王她往样今反又正支任数物果数料之战为所算同南阶被华重照通门自活影众石王农按住达在放部也维增文科万老北出。声为加其立却战半养想根件行转二面确际为济名好采手平民题变大将先被阶斗精国院保手声成程处复。完商定主及老计第切老教头油题平约划安共意到基权展而类提气统需备先长养安好五消见文市命还求本新起现声厂理些如业部数决。文满先斗为难小马证战名两层展回这局格更型音多第需性况代队维转更转做个选自马与反无造规么农可据用必厂意九车无二原民易区交名确研工没识线么所方约特。况进及看界铁龙期要造认二江飞开响可联九后律习名四拉历一到列路没写局会复算界报料际国后口品次群型记先政务情研直研府料况飞参支文万月圆派专建员书性气。青身与手此些儿规了精样研全过八运向圆办在支头空装就不原此流存候学断有达我无。做制统题市这风更积成义具热命标问己己取片并及周回层亲行料报划具住建比基备速严查问技。研连向小理物动声研京己价省集口斯增由通务斗厂合金却装一由没而为后资体去越及本由民却海府为民却海。'
      },{
        title: '重复绑定失败',
        content: '    重复绑定失败新有活在这价儿约日农温积料分参准己维权值增统例山适证式思号细出次属是现议总海写八效型即九音军商华导研最响增。志参主号队它用回工北同什什造质需重总力备求所决究究备光例置设门他动月号较根相单万约照机计我第见严但等件务市红步采当他派国间问亲规的。了段命可加新角料东动正头图义展见战带子平高物内火教公还思线改图技不强四专大进越问导高形回步们但治非民龙还何加且道给史离。北位进观日精温见统月质我思飞织习日题行应十劳人交候术至程亲风力次研真时国现决再省又金或以务少列已价。红王她往样今反又正支任数物果数料之战为所算同南阶被华重照通门自活影众石王农按住达在放部也维增文科万老北出。声为加其立却战半养想根件行转二面确际为济名好采手平民题变大将先被阶斗精国院保手声成程处复。完商定主及老计第切老教头油题平约划安共意到基权展而类提气统需备先长养安好五消见文市命还求本新起现声厂理些如业部数决。文满先斗为难小马证战名两层展回这局格更型音多第需性况代队维转更转做个选自马与反无造规么农可据用必厂意九车无二原民易区交名确研工没识线么所方约特。况进及看界铁龙期要造认二江飞开响可联九后律习名四拉历一到列路没写局会复算界报料际国后口品次群型记先政务情研直研府料况飞参支文万月圆派专建员书性气。青身与手此些儿规了精样研全过八运向圆办在支头空装就不原此流存候学断有达我无。做制统题市这风更积成义具热命标问己己取片并及周回层亲行料报划具住建比基备速严查问技。研连向小理物动声研京己价省集口斯增由通务斗厂合金却装一由没而为后资体去越及本由民却海府为民却海。'
      },{
        title: '设备已被他人绑定',
        content: '    设备已被他人绑定新有活在这价儿约日农温积料分参准己维权值增统例山适证式思号细出次属是现议总海写八效型即九音军商华导研最响增。志参主号队它用回工北同什什造质需重总力备求所决究究备光例置设门他动月号较根相单万约照机计我第见严但等件务市红步采当他派国间问亲规的。了段命可加新角料东动正头图义展见战带子平高物内火教公还思线改图技不强四专大进越问导高形回步们但治非民龙还何加且道给史离。北位进观日精温见统月质我思飞织习日题行应十劳人交候术至程亲风力次研真时国现决再省又金或以务少列已价。红王她往样今反又正支任数物果数料之战为所算同南阶被华重照通门自活影众石王农按住达在放部也维增文科万老北出。声为加其立却战半养想根件行转二面确际为济名好采手平民题变大将先被阶斗精国院保手声成程处复。完商定主及老计第切老教头油题平约划安共意到基权展而类提气统需备先长养安好五消见文市命还求本新起现声厂理些如业部数决。文满先斗为难小马证战名两层展回这局格更型音多第需性况代队维转更转做个选自马与反无造规么农可据用必厂意九车无二原民易区交名确研工没识线么所方约特。况进及看界铁龙期要造认二江飞开响可联九后律习名四拉历一到列路没写局会复算界报料际国后口品次群型记先政务情研直研府料况飞参支文万月圆派专建员书性气。青身与手此些儿规了精样研全过八运向圆办在支头空装就不原此流存候学断有达我无。做制统题市这风更积成义具热命标问己己取片并及周回层亲行料报划具住建比基备速严查问技。研连向小理物动声研京己价省集口斯增由通务斗厂合金却装一由没而为后资体去越及本由民却海府为民却海。'
      },{
        title: '获取不到设备数据',
        content: '    不到设备数据新有活在这价儿约日农温积料分参准己维权值增统例山适证式思号细出次属是现议总海写八效型即九音军商华导研最响增。志参主号队它用回工北同什什造质需重总力备求所决究究备光例置设门他动月号较根相单万约照机计我第见严但等件务市红步采当他派国间问亲规的。了段命可加新角料东动正头图义展见战带子平高物内火教公还思线改图技不强四专大进越问导高形回步们但治非民龙还何加且道给史离。北位进观日精温见统月质我思飞织习日题行应十劳人交候术至程亲风力次研真时国现决再省又金或以务少列已价。红王她往样今反又正支任数物果数料之战为所算同南阶被华重照通门自活影众石王农按住达在放部也维增文科万老北出。声为加其立却战半养想根件行转二面确际为济名好采手平民题变大将先被阶斗精国院保手声成程处复。完商定主及老计第切老教头油题平约划安共意到基权展而类提气统需备先长养安好五消见文市命还求本新起现声厂理些如业部数决。文满先斗为难小马证战名两层展回这局格更型音多第需性况代队维转更转做个选自马与反无造规么农可据用必厂意九车无二原民易区交名确研工没识线么所方约特。况进及看界铁龙期要造认二江飞开响可联九后律习名四拉历一到列路没写局会复算界报料际国后口品次群型记先政务情研直研府料况飞参支文万月圆派专建员书性气。青身与手此些儿规了精样研全过八运向圆办在支头空装就不原此流存候学断有达我无。做制统题市这风更积成义具热命标问己己取片并及周回层亲行料报划具住建比基备速严查问技。研连向小理物动声研京己价省集口斯增由通务斗厂合金却装一由没而为后资体去越及本由民却海府为民却海。'
      }],
      curIdx: 0, //聚焦点
      activeIdx: -1, //触发点
      isFocusContent: false, //聚焦到内容
    }
  },
  created() {
    this.$nextTick(() => {
      this.$tv.requestFocus(this.$refs.helpEl)
      // this.$tv.limitingEl = this.$refs["container-left"]; // 只有need-know里面的focusable可以获取焦点
      // this.$tv.setScrollEl(this.$tv.getElementByPath('//div[@class="help-content-box"]'));
      this.$tv.scrollEl = this.$tv.getElementByPath('//div[@class="help-content-box"]')
    })
  },
  destroyed() {
   // To avoid affecting the global configuration, reset the page when destroying it
    this.$tv.resetScrollEl(); 
  },
  methods: {
    onFocusQuestion(idx) {
      this.curIdx = idx
      this.activeIdx = idx
    },
    onFocusContent() {
      this.isFocusContent = true
    },
    onFocusContent(idx) { //问题点击
      // this.$tv.limitingEl = this.$refs["content"]; 
      // this.$tv.scrollEl = this.$tv.getElementByPath('//div[@class="help-content-box"]')
      // this.$tv.requestFocus(this.$refs.contentEl)
    }
  }
}
</script>

<style lang="scss" scoped>
.page{
  .container{
    position: absolute;
    top: 200px;
    left: 0;
    right: 0;
    margin: 0 auto;
    width: 1800px;
    height: 624px;
    background: rgba(240,240,240,0.10);
    box-shadow: 0 0 30px 0 rgba(0,0,0,0.50);
    border-radius: 20px;
    .container-left{
      overflow: hidden;
      line-height: 100px;
      background: rgba(240, 240, 240, .1);
      border-radius: 20px 0 0 20px;
      font-size: 44px;
      color: rgba(240,240,240,0.80);
      &>div{
        font-size: 36px;
        color: rgba(240,240,240,0.80);
        &.focus,&.active{
          color: rgba(240,240,240,1);
          font-size: 43.2px;
          background: #E99100 !important;
          font-weight: 600;
        }
        &.active{
          background: rgba(233, 145, 0, .6);
        }
      }
    }
    .content-title{
      line-height: 50px;
      font-size: 36px;
      color: rgba(240,240,240,0.80);
      font-weight: 600;
    }
    pre{
      height: 429px;
      overflow: auto;
      margin-top: 20px;
      padding-right: 20px;
      white-space: pre-wrap;
      text-align: justify;
      line-height: 32px;
      font-size: 24px;
      color: rgba(240,240,240,0.60);
      &::-webkit-scrollbar{
        width: 6px;
      }
      &::-webkit-scrollbar-thumb{
        background: #DF9213;
        border-radius: 5px;
      }
    }
    
  }
}
.content{
  position: absolute;
  width: 1360px;
  box-sizing: border-box;
  top: 200px;
  left: 500px;
  padding: 40px 48px;
}
.help-title-box{
  line-height: 50px;
  font-size: 36px;
  color: rgba(240,240,240,0.80);
  font-weight: 600;
}
.help-content-box{
  margin: 20px auto 0;
  padding-right: 20px;
  height: 429px;
  overflow: auto;
  font-size: 24px;
  color: rgba(240,240,240,0.60);
  &::-webkit-scrollbar{
    width: 6px;
  }
  &::-webkit-scrollbar-thumb{
    border-radius: 5px;
  }
  &.active::-webkit-scrollbar-thumb{
    background: #DF9213;
  }
  pre{
    text-align: justify;
    white-space: pre-line;
    line-height: 32px;
  }
}
.button-box{
  position: absolute;
  width: 1800px;
  margin: 0 auto;
  bottom: 120px;
  right: 0;
  left: 0;
  text-align: right;
  .button-box-btn{
    font-size: 36px;
    background: rgba(240, 240, 240, 0.05);
  }
}
</style>